---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationOverSizedCheck
source: html/3067d96d-7595-2952-88ef-b08de16f85aa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationOverSizedCheck Property

Fabrication part is too large to fit on the sheet metal. Replace the part with multiple smaller parts, or notify the CAM operator.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationOverSizedCheck { get; }
```